import random

CARDS_POOL = {
    "position": [
        "ЦАП (17 лет, вундеркинд)", "Ветеран ЦЗ (37 лет)", 
        "Инвертированный фулбек", "Чистый форвард-столб", "Голкипер-либеро"
    ],
    "health": [
        "Хрустальный (2 игры за сезон)", "Выносливость 99 (без замен)", 
        "Лишний вес +10 кг", "Астма", "Идеальная физуха"
    ],
    "skill": [
        "Пасы как у Педри", "Только правая нога", 
        "Дриблинг в телефонной будке", "Деревянный прием", "Удар с 40 метров"
    ],
    "inventory": [
        "Планшет Гвардиолы с тактиками", "Счастливые бутсы", 
        "Контракт на $100M", "Банка энергетика", "Золотой мяч"
    ],
    "secret": [
        "Сливает инфу журналистам", "Ставит против своей команды", 
        "Конфликтует с раздевалкой", "Нарушает режим", "Лидер раздевалки"
    ]
}

def generate_player_pack():
    return {
        "position": random.choice(CARDS_POOL["position"]),
        "health": random.choice(CARDS_POOL["health"]),
        "skill": random.choice(CARDS_POOL["skill"]),
        "inventory": random.choice(CARDS_POOL["inventory"]),
        "secret": random.choice(CARDS_POOL["secret"])
    }
